Ran Plan for project: `ApiDoc-legacy-production` dir: `legacy-production/ApiDoc` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.codeartifact: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.sns: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ecr: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.waf_regional: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.eventbridge: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ec2: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.acm: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cloudformation: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.efs: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.s3: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.efs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.codeartifact: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.sns: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ec2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.waf_regional: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ecr: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.s3: Read complete after 0s [id=1756256488]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.acm: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cloudformation: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.eventbridge: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.sqs: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.connect_campaigns: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.waf_regional: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.shield: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.connect_campaigns: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.kinesis: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.lambda: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.kinesis: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.elbv2: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.shield: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.connect_campaigns: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.waf_regional: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.connect_campaigns: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.shield: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.kinesis: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.sqs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.elbv2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.lambda: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.shield: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.wafv2: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.elbv2: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.kinesis: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.kms: Reading...
module.pipeline_integration_guide_test_role.data.aws_caller_identity.current: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cloudformation: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cognito: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ecr: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ecr: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ssm: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.elbv2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.kms: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.wafv2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_caller_identity.current: Read complete after 0s [id=519527725796]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.eks: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cloudformation: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cognito: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.dynamodb: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.lambda: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.sns: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.dynamodb: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.ssm: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.s3: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ssm: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.rds: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.sns: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cognito: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.dynamodb: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.api_gateway: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.dynamodb: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.rds: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.eks: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.iam: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ssm: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.lambda: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.api_gateway: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.s3: Read complete after 0s [id=3945104058]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.acm: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.secretsmanager: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.iam: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cognito: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.eks: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.rds: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.eventbridge: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.route53: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.acm: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.api_gateway: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.secretsmanager: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.iam: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ec2: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.eks: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.eventbridge: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.rds: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.iam: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_caller_identity.current: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.codeartifact: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.api_gateway: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.ec2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.route53: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.route53: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.sqs: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.wafv2: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.wafv2: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.kms: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.codeartifact: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.route53: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.sqs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.assume_role: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.kms: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.secretsmanager: Reading...
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.efs: Reading...
module.pipeline_integration_guide_production_role.data.aws_caller_identity.current: Read complete after 0s [id=519527725796]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.efs: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3752056699]
module.pipeline_integration_guide_test_role.data.aws_iam_policy_document.secretsmanager: Read complete after 0s [id=1132004489]
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.assume_role: Reading...
module.pipeline_integration_guide_production_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3752056699]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.pipeline_integration_guide_production_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:TagSession",
+                           "sts:AssumeRoleWithWebIdentity",
+                           "sts:AssumeRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/ApiDoc:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS       = []
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
+                           Service   = []
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "pipeline-integration-guide-production-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "account_name" = "legacy-production"
+           "managed_by"   = "terraform"
+           "path"         = "legacy-production/ApiDoc"
+           "repo"         = "terraform-plenti-iam"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.pipeline_integration_guide_production_role.aws_iam_role_policy.s3[0] will be created
+ resource "aws_iam_role_policy" "s3" {
+       id          = (known after apply)
+       name        = "SimpleStorageService"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:DeleteObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucketVersions",
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::cdn.ratesetter.com.au"
                    },
+                   {
+                       Action   = [
+                           "s3:GetObjectVersionTorrent",
+                           "s3:GetObjectVersionTagging",
+                           "s3:GetObjectVersionAcl",
+                           "s3:GetObjectVersion",
+                           "s3:GetObjectTorrent",
+                           "s3:GetObjectTagging",
+                           "s3:GetObjectAcl",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
+                   {
+                       Action   = [
+                           "s3:PutObjectVersionTagging",
+                           "s3:PutObjectVersionAcl",
+                           "s3:PutObjectTagging",
+                           "s3:PutObjectAcl",
+                           "s3:PutObject",
+                           "s3:ListMultipartUploadParts",
+                           "s3:AbortMultipartUpload",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = "pipeline-integration-guide-production-role"
    }

  # module.pipeline_integration_guide_test_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "sts:TagSession",
+                           "sts:AssumeRoleWithWebIdentity",
+                           "sts:AssumeRole",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/ApiDoc:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS       = []
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
+                           Service   = []
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "pipeline-integration-guide-test-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "account_name" = "legacy-production"
+           "managed_by"   = "terraform"
+           "path"         = "legacy-production/ApiDoc"
+           "repo"         = "terraform-plenti-iam"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.pipeline_integration_guide_test_role.aws_iam_role_policy.s3[0] will be created
+ resource "aws_iam_role_policy" "s3" {
+       id          = (known after apply)
+       name        = "SimpleStorageService"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "s3:DeleteObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::test.cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucketVersions",
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::test.cdn.ratesetter.com.au"
                    },
+                   {
+                       Action   = [
+                           "s3:GetObjectVersionTorrent",
+                           "s3:GetObjectVersionTagging",
+                           "s3:GetObjectVersionAcl",
+                           "s3:GetObjectVersion",
+                           "s3:GetObjectTorrent",
+                           "s3:GetObjectTagging",
+                           "s3:GetObjectAcl",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::test.cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
+                   {
+                       Action   = [
+                           "s3:PutObjectVersionTagging",
+                           "s3:PutObjectVersionAcl",
+                           "s3:PutObjectTagging",
+                           "s3:PutObjectAcl",
+                           "s3:PutObject",
+                           "s3:ListMultipartUploadParts",
+                           "s3:AbortMultipartUpload",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::test.cdn.ratesetter.com.au/ui/integrationguide/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = "pipeline-integration-guide-test-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pipeline_integration_guide_production_role_arn = (known after apply)
+ pipeline_integration_guide_test_role_arn       = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ApiDoc-legacy-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.security.public.plenti.cloud/lock?id=plentiau%252Fterraform-plenti-iam%252Flegacy-production%252FApiDoc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ApiDoc-legacy-production
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```